app/Controllers/Prestamos.php

SELECT *
FROM `recursos`
WHERE `recursos`.`deleted_at` IS NULL
---
    public function crear()
    {
        $recursoModel = new \App\Models\RecursoModel();
        $usuarioModel = new \App\Models\UsuarioModel();

        $data['recursos'] = $recursoModel->findAll();

DELETE FROM `prestamos_detalle`
WHERE `id_prestamo` = '5'
SELECT *
FROM `recursos`
WHERE `recursos`.`deleted_at` IS NULL
AND `recursos`.`id` = '4'
UPDATE `recursos` SET `numero_ejemplares` = 5, `updated_at` = '2024-12-17 18:38:37'
WHERE `recursos`.`id` IN ('4')
DELETE FROM `prestamos`
WHERE `id_prestamo` IN ('5')
---
    public function eliminar($id)
    {
        $detalles = $this->prestamoModel->obtenerDetallesPrestamo($id);
        $recursoModel = new \App\Models\RecursoModel();

        $this->prestamoModel->db->table('prestamos_detalle')->where('id_prestamo', $id)->delete();

        foreach ($detalles as $detalle) {
            $recurso = $recursoModel->find($detalle['id_recurso']);
            $nuevaCantidad = $recurso['numero_ejemplares'] + 1;
            $recursoModel->update($detalle['id_recurso'], ['numero_ejemplares' => $nuevaCantidad]);
        }

        $this->prestamoModel->delete($id);