app/Models/PrestamoModel.php

    public function obtenerPrestamos()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('prestamos');
        $builder->select('prestamos.*, users.nombre as nombre_usuario');
        $builder->join('users', 'users.id = prestamos.id_usuario');
        $prestamos = $builder->get()->getResultArray();
---
SELECT `prestamos`.*, `users`.`nombre` as `nombre_usuario`
FROM `prestamos`
JOIN `users` ON `users`.`id` = `prestamos`.`id_usuario`

    public function obtenerDetallesPrestamo($idPrestamo)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('prestamos_detalle');
        $builder->select('prestamos_detalle.*, recursos.titulo as nombre_recurso');
        $builder->join('recursos', 'recursos.id = prestamos_detalle.id_recurso');
        $builder->where('prestamos_detalle.id_prestamo', $idPrestamo);
        return $builder->get()->getResultArray();
---
SELECT `prestamos_detalle`.*, `recursos`.`titulo` as `nombre_recurso`
FROM `prestamos_detalle`
JOIN `recursos` ON `recursos`.`id` = `prestamos_detalle`.`id_recurso`
WHERE `prestamos_detalle`.`id_prestamo` = '5'